emfcamp/Mk4-micropython-board/boards/CC3220SF_LAUNCHXL/mpconfigboard.h
#ifndef MPCONFIBOARD_H_INC
#define MPCONFIBOARD_H_INC

#define MICROPY_HW_BOARD_NAME        "CC3220SF_LAUNCHXL"
#define MICROPY_HW_MCU_NAME          "TI CC3220SF"

#define MICROPY_PY_SOCKET            (1)
#define MICROPY_PY_NETWORK           (1)
#define MICROPY_PY_NETWORK_WIFI      (1)   /* TI WiFi */

#define MICROPY_MACHINE_NVSBDEV      (0)
#define MICROPY_MACHINE_SD           (1)

#endif
